PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    if (len > 0 && len < 512) {
        char relay_topic[MQTT_TOPIC_MAX_LENGTH];
        esp_err_t topic_ret = mqtt_manager_get_panel_topic(relay_topic, sizeof(relay_topic), "relays");
        
        if (topic_ret == ESP_OK) {
            esp_err_t ret = mqtt_manager_publish_json(relay_topic, json_buffer, 1, false);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Relay %s state change published to %s: %s -> %s", 
                        event->relay_id,
                        relay_topic,
                        (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC",
                        (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC");
            } else {
                ESP_LOGW(TAG, "Failed to publish relay event: %s", esp_err_to_name(ret));
            }
        } else {
            ESP_LOGW(TAG, "No panel configuration, using generic topic");
            char generic_topic[128];
            snprintf(generic_topic, sizeof(generic_topic), "esp32/%s/relays", esp32_id);
            mqtt_manager_publish_json(generic_topic, json_buffer, 1, false);
        }
    } else {
        ESP_LOGE(TAG, "Relay event JSON too large or formatting error");
    }
    
    memset(json_buffer, 0, 512);
    free(json_buffer);
    json_buffer = NULL;
    
    heap_caps_check_integrity_all(true);
}

static esp_err_t relay_mqtt_command_callback(const char *topic, const char *command_json, void *user_data) {
    ESP_LOGI(TAG, "Processing relay MQTT command from topic: %s", topic);
    ESP_LOGI(TAG, "Command JSON: %s", command_json);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    return ESP_OK;
}

static void mqtt_state_callback(mqtt_manager_state_t state, void *user_data) {
    switch (state) {
        case MQTT_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            g_mqtt_connected = true;
            
            if (!g_relay_manager_initialized) {
                ESP_LOGI(TAG, "Initializing Relay Manager after MQTT connection");
                esp_err_t ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    relay_manager_check_all_states(true);
                    g_relay_manager_initialized = true;
                    ESP_LOGI(TAG, "Relay Manager initialized successfully");
                } else {
                    ESP_LOGE(TAG, "Failed to initialize Relay Manager: %s", esp_err_to_name(ret));
                }
            }
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                
                if (g_wifi_connected && g_mqtt_connected) {
                    watchdog_manager_set_mode(WATCHDOG_MODE_RUNNING);
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "MQTT disconnected");
            g_mqtt_connected = false;
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_ERROR:
            ESP_LOGW(TAG, "MQTT error");
            g_mqtt_connected = false;
            break;
            
        default:
            break;
    }
}

static void mqtt_message_callback(const char *topic, const char *data, int data_len, void *user_data) {
    ESP_LOGI(TAG, "MQTT message: %s (%d bytes)", topic ? topic : "NULL", data_len);
    
    if (!topic || !data) {
        ESP_LOGE(TAG, "Invalid MQTT message: topic or data is NULL");
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    size_t free_heap = esp_get_free_heap_size();
    if (free_heap < 40000) {
        ESP_LOGW(TAG, "Low memory: %zu bytes", free_heap);
        heap_caps_check_integrity_all(true);
        vTaskDelay(pdMS_TO_TICKS(100));
        
        if (strstr(topic, "/config/") != NULL) {
            ESP_LOGE(TAG, "Cannot process config with low memory");
            mqtt_manager_send_config_response(false, "Insufficient memory");
        }
        return;
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) != ESP_OK) {
        ESP_LOGE(TAG, "Could not get ESP32 ID");
        return;
    }
    
    char deleted_topic[128];
    snprintf(deleted_topic, sizeof(deleted_topic), "esp32/notify/%s/deleted", esp32_id);
    
    if (strcmp(topic, deleted_topic) == 0) {
        ESP_LOGW(TAG, "Deletion notification received");
        config_manager_erase_key("client_id");
        config_manager_erase_key("panel_id");
        config_manager_erase_key("panel_name");
        config_manager_erase_key("location");
        mqtt_manager_clear_panel_config();
        
        if (g_relay_manager_initialized) {
            relay_manager_deinit();
            g_relay_manager_initialized = false;
        }
        
        time_manager_reset_network_info_sent();
        g_need_reregister = true;
        vTaskDelay(pdMS_TO_TICKS(1000));
        mqtt_manager_send_network_info();
        return;
    }
    
    char config_topic[128];
    snprintf(config_topic, sizeof(config_topic), "esp32/config/%s", esp32_id);
    
    if (strcmp(topic, config_topic) == 0) {
        ESP_LOGI(TAG, "Configuration message received");
        
        esp_err_t ret = process_esp32_configuration(data);
        
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Configuration accepted");
            
            if (!g_relay_manager_initialized) {
                vTaskDelay(pdMS_TO_TICKS(500));
                ESP_LOGI(TAG, "Initializing Relay Manager");
                ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    g_relay_manager_initialized = true;
                }
            }
        }
    }
    else if (strstr(topic, "/relay_config") && g_relay_manager_initialized) {
        cJSON *json = cJSON_ParseWithLength(data, data_len);
        if (json) {
            cJSON *command = cJSON_GetObjectItem(json, "command");
            cJSON *relay_id = cJSON_GetObjectItem(json, "relay_id");
            cJSON *is_active = cJSON_GetObjectItem(json, "is_active");
            
            if (command && relay_id && 
                strcmp(cJSON_GetStringValue(command), "update_config") == 0) {
                
                const char *relay_name = cJSON_GetStringValue(relay_id);
                
