PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
                if (relay_name && is_active) {
                    relay_manager_set_active(relay_name, cJSON_IsTrue(is_active));
                    ESP_LOGI(TAG, "Relay %s %s", relay_name,
                            cJSON_IsTrue(is_active) ? "ACTIVATED" : "DEACTIVATED");
                    
                    cJSON *contact_type = cJSON_GetObjectItem(json, "contact_type");
                    if (contact_type && cJSON_IsString(contact_type)) {
                        const char *type_str = cJSON_GetStringValue(contact_type);
                        relay_contact_type_t type = strcmp(type_str, "NC") == 0 ? 
                                                RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                        relay_manager_set_contact_type(relay_name, type);
                        ESP_LOGI(TAG, "Relay %s contact type set to %s", relay_name, type_str);
                    }
                    
                    cJSON *custom_name = cJSON_GetObjectItem(json, "custom_name");
                    if (custom_name && cJSON_IsString(custom_name)) {
                        const char *name_str = cJSON_GetStringValue(custom_name);
                        if (name_str && strlen(name_str) > 0) {
                            relay_manager_set_name(relay_name, name_str);
                            ESP_LOGI(TAG, "Relay %s custom name set to '%s'", relay_name, name_str);
                        }
                    }
                }
            }
            cJSON_Delete(json);
        }
    }
}

static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    char esp32_id[ESP32_ID_LENGTH + 1];
    
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "WiFi connected");
            g_wifi_connected = true;
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            time_manager_sync_time();
            
            if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(esp32_id) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "WiFi disconnected");
            g_wifi_connected = false;
            g_mqtt_connected = false;
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_AP_MODE:
            ESP_LOGI(TAG, "WiFi AP mode active");
            g_wifi_connected = false;
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

static void on_wifi_connect_callback(void *user_data) {
    ESP_LOGI(TAG, "WiFi configured via captive portal");
    
    if (wifi_captive_portal_is_active()) {
        wifi_captive_portal_stop();
        esp_wifi_set_mode(WIFI_MODE_STA);
    }
}

static void system_monitor_task(void *pvParameters) {
    ESP_LOGI(TAG, "System monitor task started");
    
    bool task_registered = false;
    int registration_attempts = 0;
    const int max_attempts = 10;
    
    vTaskDelay(pdMS_TO_TICKS(2000));
    
    while (!task_registered && registration_attempts < max_attempts) {
        if (g_watchdog_available) {
            esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
            if (wd_ret == ESP_OK) {
                ESP_LOGI(TAG, "System monitor task registered in watchdog manager");
                task_registered = true;
                break;
            } else {
                ESP_LOGW(TAG, "Registration attempt %d failed: %s", 
                        registration_attempts + 1, esp_err_to_name(wd_ret));
            }
        }
        
        registration_attempts++;
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    
    if (!task_registered) {
        ESP_LOGE(TAG, "Failed to register system monitor task after %d attempts", max_attempts);
        ESP_LOGE(TAG, "System monitor will run without watchdog protection");
    }
    
    uint32_t cycle_count = 0;
    uint32_t feed_error_count = 0;
    
    while (1) {
        if (task_registered) {
            esp_err_t feed_ret = watchdog_manager_feed();
            if (feed_ret != ESP_OK) {
                feed_error_count++;
                ESP_LOGW(TAG, "Watchdog feed failed: %s (count: %lu)", 
                        esp_err_to_name(feed_ret), feed_error_count);
                
                if (feed_error_count >= 20) {
                    ESP_LOGE(TAG, "Too many feed failures, unregistering task");
                    watchdog_manager_unregister_task(NULL);
                    task_registered = false;
                    feed_error_count = 0;
                }
            } else {
                if (feed_error_count > 0) {
                    feed_error_count = 0;
                }
            }
        }
        
        cycle_count++;
        
        if (cycle_count % 60 == 0 && g_relay_manager_initialized) {
            ESP_LOGI(TAG, "Performing periodic relay check");
            esp_err_t relay_ret = relay_manager_check_all_states(false);
            if (relay_ret != ESP_OK) {
                ESP_LOGW(TAG, "Relay check failed: %s", esp_err_to_name(relay_ret));
            }
        }
        
        if (time_manager_should_send_network_info() || g_need_reregister) {
            ESP_LOGI(TAG, "Sending network info %s", 
                    g_need_reregister ? "after deletion notification" : "after NTP synchronization");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Network info sent successfully");
                time_manager_mark_network_info_sent();
                g_need_reregister = false;
            } else {
                ESP_LOGW(TAG, "Failed to send network info: %s", esp_err_to_name(ret));
            }
        }
        
