PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
        size_t free_heap = esp_get_free_heap_size();
        if (free_heap < 40000) {
            ESP_LOGW(TAG, "Low memory detected: %zu bytes - Performing emergency cleanup", free_heap);
            
            if (mqtt_manager_is_connected()) {
                ESP_LOGI(TAG, "Triggering MQTT memory cleanup");
                mqtt_manager_emergency_memory_cleanup();
            }
            
            force_heap_cleanup();
            
            size_t free_after = esp_get_free_heap_size();
            ESP_LOGI(TAG, "Memory after cleanup: %zu bytes (recovered: %d bytes)", 
                    free_after, (int)(free_after - free_heap));
        }
        
        if (cycle_count % 360 == 0) {
            force_heap_cleanup();
        }
        
        if (cycle_count % 120 == 0) {
            print_memory_info();
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        
        g_wifi_connected = wifi_connected;
        g_mqtt_connected = mqtt_connected;
        
        if (wifi_connected) {
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                esp_wifi_set_mode(WIFI_MODE_STA);
            }
            
            if (!time_manager_is_synchronized()) {
                esp_err_t time_ret = time_manager_check_sync();
                if (time_ret != ESP_OK && time_ret != ESP_ERR_NOT_FINISHED) {
                    ESP_LOGD(TAG, "Time sync check result: %s", esp_err_to_name(time_ret));
                }
            }
            
            if (free_heap > 30000) {
                esp_err_t mqtt_ret = mqtt_manager_loop(0);
                if (mqtt_ret != ESP_OK) {
                    ESP_LOGD(TAG, "MQTT loop result: %s", esp_err_to_name(mqtt_ret));
                }
            } else {
                ESP_LOGW(TAG, "Skipping MQTT loop due to low memory: %zu bytes", free_heap);
            }
            
            if (mqtt_connected) {
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                if (cycle_count % 24 == 0) {
                    char time_str[32];
                    if (time_manager_get_lima_time_str(time_str, sizeof(time_str)) == ESP_OK) {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected, Time: %s", time_str);
                    } else {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected");
                    }
                }
            } else {
                if (cycle_count % 24 == 0 && free_heap > 50000) {
                    ESP_LOGI(TAG, "Retrying MQTT connection");
                    char esp32_id[ESP32_ID_LENGTH + 1];
                    if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(esp32_id);
                        mqtt_manager_connect();
                    }
                } else if (free_heap <= 50000) {
                    ESP_LOGW(TAG, "Skipping MQTT reconnect due to low memory: %zu bytes", free_heap);
                }
            }
        } else {
            if (cycle_count % 12 == 0) {
                ESP_LOGI(TAG, "WiFi disconnected - attempting recovery");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 3);
            }
        }
        
        if (g_watchdog_available) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                ESP_LOGW(TAG, "System health degraded: %d", health);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");

    ESP_LOGI(TAG, "Phase 1: Basic initialization");
    
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        ESP_LOGW(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(3000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            ESP_LOGE(TAG, "Watchdog initialization failed twice: %s", esp_err_to_name(watchdog_ret));
            ESP_LOGE(TAG, "CRITICAL: System cannot function safely without watchdog");
            vTaskDelay(pdMS_TO_TICKS(5000));
            esp_restart();
        }
    }
    
    ESP_LOGI(TAG, "Watchdog manager initialized successfully");
    g_watchdog_available = true;
    
    watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
    
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    bool main_task_registered = false;
    int main_reg_attempts = 0;
    while (!main_task_registered && main_reg_attempts < 5) {
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret == ESP_OK) {
            ESP_LOGI(TAG, "Main task registered in watchdog manager");
            main_task_registered = true;
        } else {
            ESP_LOGW(TAG, "Main task registration attempt %d failed: %s", 
                    main_reg_attempts + 1, esp_err_to_name(reg_ret));
            main_reg_attempts++;
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    
    if (!main_task_registered) {
        ESP_LOGE(TAG, "CRITICAL: Could not register main task in watchdog");
        esp_restart();
    }
    
    ESP_ERROR_CHECK(config_manager_init());
    if (main_task_registered) {
        esp_err_t feed_ret = watchdog_manager_feed();
        if (feed_ret != ESP_OK) {
            ESP_LOGW(TAG, "Initial watchdog feed failed: %s", esp_err_to_name(feed_ret));
        }
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)));
    ESP_LOGI(TAG, "ESP32 ID: %s", esp32_id);
    
    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    ESP_LOGI(TAG, "MAC: %s", mac_address);
    
